<template>
  <div class="card-feedbacks">
    <feedback
      v-for="(feedback, i) of partFeedbacks"
      :key="i"
      :feedback="feedback"
    />
    <div
      v-if="feedbacks.length !== partFeedbacks.length"
      class="line"
    />
    <v-btn
      v-if="feedbacks.length !== partFeedbacks.length"
      class="btn-grey"
      @click="partFeedbacks = feedbacks"
    >
      Показать больше отзывов
    </v-btn>
  </div>
</template>

<script>
import Feedback from '~/components/page-parts/card-item/info-bottom/feedback'

export default {
  name: 'Feedbacks',
  components: {
    Feedback
  },
  data () {
    return {
      feedbacks: [
        {
          img: 'profile-mini.png',
          name: 'Виктория',
          date: '29 июня 2020',
          stars: 4,
          text: 'Всё соответствует, полный комплект бретелей, по качеству и описанию соответствует полностью, комфортный и практичный, спасибо !'
        },
        {
          img: null,
          name: 'Нина',
          date: '29 июня 2020',
          stars: 5,
          text: 'Всё соответствует, полный комплект бретелей, по качеству и описанию соответствует полностью, комфортный и практичный, спасибо !'
        },
        {
          img: null,
          name: 'Виктория',
          date: '29 июня 2020',
          stars: 3,
          text: 'Всё соответствует, полный комплект бретелей, по качеству и описанию соответствует полностью, комфортный и практичный, спасибо !'
        },
        {
          img: null,
          name: 'Виктория',
          date: '29 июня 2020',
          stars: 5,
          text: 'Всё соответствует, полный комплект бретелей, по качеству и описанию соответствует полностью, комфортный и практичный, спасибо !'
        },
        {
          img: 'profile-mini.png',
          name: 'Виктория',
          date: '29 июня 2020',
          stars: 5,
          text: 'Всё соответствует, полный комплект бретелей, по качеству и описанию соответствует полностью, комфортный и практичный, спасибо !'
        },
        {
          img: 'profile-mini.png',
          name: 'Виктория',
          date: '29 июня 2020',
          stars: 5,
          text: 'Всё соответствует, полный комплект бретелей, по качеству и описанию соответствует полностью, комфортный и практичный, спасибо !'
        },
        {
          img: 'profile-mini.png',
          name: 'Виктория',
          date: '29 июня 2020',
          stars: 4,
          text: 'Всё соответствует, полный комплект бретелей, по качеству и описанию соответствует полностью, комфортный и практичный, спасибо !'
        },
        {
          img: null,
          name: 'Виктория',
          date: '29 июня 2020',
          stars: 4,
          text: 'Всё соответствует, полный комплект бретелей, по качеству и описанию соответствует полностью, комфортный и практичный, спасибо !'
        },
        {
          img: null,
          name: 'Виктория',
          date: '29 июня 2020',
          stars: 4,
          text: 'Всё соответствует, полный комплект бретелей, по качеству и описанию соответствует полностью, комфортный и практичный, спасибо !'
        },
        {
          img: null,
          name: 'Виктория',
          date: '29 июня 2020',
          stars: 3,
          text: 'Всё соответствует, полный комплект бретелей, по качеству и описанию соответствует полностью, комфортный и практичный, спасибо !'
        },
        {
          img: null,
          name: 'Виктория',
          date: '29 июня 2020',
          stars: 4,
          text: 'Всё соответствует, полный комплект бретелей, по качеству и описанию соответствует полностью, комфортный и практичный, спасибо !'
        },
        {
          img: 'profile-mini.png',
          name: 'Виктория',
          date: '29 июня 2020',
          stars: 5,
          text: 'Всё соответствует, полный комплект бретелей, по качеству и описанию соответствует полностью, комфортный и практичный, спасибо !'
        }
      ],
      partFeedbacks: []
    }
  },
  mounted () {
    this.isFeedbacks()
  },
  methods: {
    isFeedbacks () {
      this.partFeedbacks = this.feedbacks.slice(0, 4)
    }
  }
}
</script>
